In [2]:
import pandas as pd

data = {
    "employee_id": [2, 3, 7, 8, 9],
    "name": ["Meir", "Michael", "Addilyn", "Juan", "Kannon"],
    "salary": [3000, 3800, 7400, 6100, 7700]
}

employees = pd.DataFrame(data=data)

employees

   employee_id     name  salary
0            2     Meir    3000
1            3  Michael    3800
2            7  Addilyn    7400
3            8     Juan    6100
4            9   Kannon    7700

The bonus of an employee is 100% of their salary if the ID of the employee is an odd number and the employee's name does not start with the character 'M'.

In [75]:
def calculate_special_bonus(employees: pd.DataFrame) -> pd.DataFrame:
  employees['bonus'] = 0
  mask = (employees['employee_id'] % 2 != 0) & (~employees['name'].str.startswith('M'))
  
  employees.loc[mask,'bonus'] = employees.loc[mask,'salary']
  return  employees[['employee_id','bonus']]

In [76]:
calculate_special_bonus(employees)

   employee_id  bonus
0            2      0
1            3      0
2            7   7400
3            8      0
4            9   7700